import comp from "E:/Code/vscode/blog/vuepress-starter/docs/.vuepress/.temp/pages/other/yupan/index.html.vue"
const data = JSON.parse("{\"path\":\"/other/yupan/\",\"title\":\"\",\"lang\":\"zh-CN\",\"frontmatter\":{},\"headers\":[{\"level\":2,\"title\":\"🚀 云盘搜索\",\"slug\":\"🚀-云盘搜索\",\"link\":\"#🚀-云盘搜索\",\"children\":[]},{\"level\":2,\"title\":\"📋 项目概述\",\"slug\":\"📋-项目概述\",\"link\":\"#📋-项目概述\",\"children\":[]},{\"level\":2,\"title\":\"🛠️ 技术架构\",\"slug\":\"🛠️-技术架构\",\"link\":\"#🛠️-技术架构\",\"children\":[]},{\"level\":2,\"title\":\"🔄 系统流程\",\"slug\":\"🔄-系统流程\",\"link\":\"#🔄-系统流程\",\"children\":[{\"level\":3,\"title\":\"1️⃣ 浏览器插件功能\",\"slug\":\"_1️⃣-浏览器插件功能\",\"link\":\"#_1️⃣-浏览器插件功能\",\"children\":[]},{\"level\":3,\"title\":\"2️⃣ 数据爬取流程\",\"slug\":\"_2️⃣-数据爬取流程\",\"link\":\"#_2️⃣-数据爬取流程\",\"children\":[]},{\"level\":3,\"title\":\"3️⃣ 数据存储流程\",\"slug\":\"_3️⃣-数据存储流程\",\"link\":\"#_3️⃣-数据存储流程\",\"children\":[]},{\"level\":3,\"title\":\"4️⃣ 数据验证流程\",\"slug\":\"_4️⃣-数据验证流程\",\"link\":\"#_4️⃣-数据验证流程\",\"children\":[]},{\"level\":3,\"title\":\"5️ 搜索限制\",\"slug\":\"_5️-搜索限制\",\"link\":\"#_5️-搜索限制\",\"children\":[]}]},{\"level\":2,\"title\":\"📊 流程图\",\"slug\":\"📊-流程图\",\"link\":\"#📊-流程图\",\"children\":[]},{\"level\":2,\"title\":\"🔑 关键功能说明\",\"slug\":\"🔑-关键功能说明\",\"link\":\"#🔑-关键功能说明\",\"children\":[{\"level\":3,\"title\":\"1️⃣ 浏览器插件功能\",\"slug\":\"_1️⃣-浏览器插件功能-1\",\"link\":\"#_1️⃣-浏览器插件功能-1\",\"children\":[]},{\"level\":3,\"title\":\"2️⃣ 定时任务\",\"slug\":\"_2️⃣-定时任务\",\"link\":\"#_2️⃣-定时任务\",\"children\":[]},{\"level\":3,\"title\":\"3️⃣ 断点续爬功能\",\"slug\":\"_3️⃣-断点续爬功能\",\"link\":\"#_3️⃣-断点续爬功能\",\"children\":[]},{\"level\":3,\"title\":\"4️⃣ HashID 生成\",\"slug\":\"_4️⃣-hashid-生成\",\"link\":\"#_4️⃣-hashid-生成\",\"children\":[]},{\"level\":3,\"title\":\"5️⃣ 数据存储\",\"slug\":\"_5️⃣-数据存储\",\"link\":\"#_5️⃣-数据存储\",\"children\":[]},{\"level\":3,\"title\":\"6️⃣ URL 验证\",\"slug\":\"_6️⃣-url-验证\",\"link\":\"#_6️⃣-url-验证\",\"children\":[]}]},{\"level\":2,\"title\":\"🚀 部署要求\",\"slug\":\"🚀-部署要求\",\"link\":\"#🚀-部署要求\",\"children\":[]}],\"git\":{},\"filePathRelative\":\"other/yupan/README.md\"}")
export { comp, data }

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
